import React, { useState } from 'react';
import css from './AboutUs.module.css';

const AboutUs = () => {
  // Створюємо стан для керування видимістю тексту
  const [isExpanded, setIsExpanded] = useState(false);

  // Функція для зміни стану при натисканні на кнопку
  const toggleText = () => {
    setIsExpanded(!isExpanded);
  };

  return (
    <div>
      <div className={css.aboutUsText}>
        <button className={css.aboutUsBtn} onClick={toggleText}>
          Про нас
        </button>

        {/* Відображення тексту залежно від стану */}
        {isExpanded && (
          <p className={css.title}>
            <strong>Що ми пропонуємо: </strong> Широкий асортимент: У нашому
            каталозі ви знайдете все необхідне для будівництва та ремонту - від
            цегли, цементу та утеплювачів до оздоблювальних матеріалів,
            сантехніки та електрики.
            <br />
            <strong> Якісна продукція:</strong> Ми співпрацюємо лише з
            перевіреними виробниками та постачальниками, що гарантує високу
            якість кожного товару.
            <br />
            <strong>Конкурентні ціни: </strong> Ми пропонуємо вигідні ціни на
            всі товари, регулярні акції та знижки, що робить покупки у нас ще
            більш вигідними. <br />
            <strong>Зручний сервіс: </strong> Простий та інтуїтивно зрозумілий
            інтерфейс нашого сайту дозволяє легко знайти потрібні товари,
            оформити замовлення та оплатити його онлайн.
            <br />
            <strong>Швидка доставка: </strong> Ми організовуємо оперативну
            доставку по всій країні, забезпечуючи швидке та безпечне перевезення
            ваших замовлень.
            <br />
            <strong>Професійна консультація: </strong>Професійна консультація:
            Наші спеціалісти завжди готові надати кваліфіковану консультацію,
            допомогти з вибором матеріалів та інструментів. <br />
            <strong>Чому обирають нас:</strong> Надійність та довіра: Ми цінуємо
            кожного клієнта і гарантуємо високий рівень обслуговування.
            <br /> <strong> Зручність покупок:</strong> Замовляйте будівельні
            матеріали, не виходячи з дому, та отримуйте все необхідне в
            найкоротші терміни.
            <br /> <strong>Актуальний асортимент: </strong>Актуальний
            асортимент: Постійне оновлення товарів та широкий вибір продукції
            задовольнять потреби як професіоналів, так і аматорів. Ми прагнемо
            зробити процес покупки будівельних матеріалів максимально простим та
            приємним для вас.
            <br />
            <strong>Дякуємо, що обираєте наш інтернет-магазин! </strong>
          </p>
        )}
      </div>
    </div>
  );
};

export default AboutUs;
